<a href="https://colab.research.google.com/github/shikhargoswami/Cars24_Assessment/blob/main/Case_Study_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

# Creating Dataframes of Customer table and Flight table

In [2]:
s1 = pd.Series(['A123','A456','A789'])
s2 = pd.Series(['9342312',	'6542312',	'7542312'])
s3 = pd.Series(['Delhi',	'Delhi',	'Delhi'])
s4 = pd.Series(['Mumbai',	'Mumbai',	'Mumbai'])
s5 = pd.Series(['815',	'830',	'845'])
s6 = pd.Series(['1730',	'1015',	'1330'])
cust = pd.DataFrame(pd.concat([s1,s2,s3,s4,s5,s6],axis=1))
cust.columns = ['ID',	'Ticket ID',	'Origin',	'Destination',	'Start time',	'End time']

In [3]:
s1 = pd.Series(['B99',	'B89',	'B69',	'B79',	'B59',	'B49',	'B39'])
s2 = pd.Series(['4042014',	'4042014',	'4042014',	'4042014',	'4042014',	'4042014',	'4042014'])
s3 = pd.Series(['Delhi',	'Delhi',	'Jaipur',	'Delhi',	'Agra',	'Surat',	'Pune'])
s4 = pd.Series(['Mumbai',	'Jaipur',	'Mumbai',	'Agra',	'Surat',	'Pune',	'Mumbai'])
s5 = pd.Series(['830',	'845',	'1130',	'815',	'1230',	'1445',	'1615'])
s6 = pd.Series(['1015',	'1045',	'1330',	'1130',	'1430',	'1530',	'1730'])
flights = pd.DataFrame(pd.concat([s1,s2,s3,s4,s5,s6],axis=1))
flights.columns = ['flight_no','date','orig_port','dest_port',	'flight_start',	'flight_end']

In [4]:
flights

  flight_no     date orig_port dest_port flight_start flight_end
0       B99  4042014     Delhi    Mumbai          830       1015
1       B89  4042014     Delhi    Jaipur          845       1045
2       B69  4042014    Jaipur    Mumbai         1130       1330
3       B79  4042014     Delhi      Agra          815       1130
4       B59  4042014      Agra     Surat         1230       1430
5       B49  4042014     Surat      Pune         1445       1530
6       B39  4042014      Pune    Mumbai         1615       1730

In [5]:
cust

     ID Ticket ID Origin Destination Start time End time
0  A123   9342312  Delhi      Mumbai        815     1730
1  A456   6542312  Delhi      Mumbai        830     1015
2  A789   7542312  Delhi      Mumbai        845     1330

# Finding Recursive Destination

In [6]:
def find_dest(prev_dest,prev_end_time,final_dest,final_time,df,i):
    
    a = flights[((flights['orig_port']==prev_dest[0]) & (flights['flight_start']>=prev_end_time[0]))][['dest_port','flight_end','flight_no']]
    
    df = df.append({'Customer_ID' : cust.loc[i,'ID'], 'Ticket_ID' : cust.loc[i,'Ticket ID'], 'Flight_no' : a.flight_no.values[0]},  
                ignore_index = True)
    
    if ((a.dest_port.values==final_dest) & (a['flight_end'].values==final_time)):
        return df
        
    else:
        
        return find_dest(a.dest_port.values, a['flight_end'].values,final_dest,final_time,df,i)

#Appending flights from recursive destinations from source

In [7]:
#create empty dataframe to append data to
df4 = pd.DataFrame(columns = ['Customer_ID', 'Ticket_ID', 'Flight_no'])

for i in range(0,cust.shape[0]):
    
    cust_orig = cust.loc[i,'Origin']
    cust_dest = cust.loc[i,'Destination']
    cust_abs_start = cust.loc[i,'Start time']
    cust_abs_end = cust.loc[i,'End time']
    
    
    
    a1 = flights[((flights['orig_port']==cust_orig) & (flights['flight_start']==cust_abs_start))][['dest_port','flight_end','flight_no']]
    
    #append flight details of only flight for given time
    df4 = df4.append({'Customer_ID' : cust.loc[i,'ID'], 'Ticket_ID' : cust.loc[i,'Ticket ID'], 'Flight_no' : a1.flight_no.values[0]},  
                ignore_index = True)
    
    #check if there is no direct flight
    if ((a1.dest_port.values!=cust_dest) & (a1['flight_end'].values!=cust_abs_end)):
       df4 = find_dest(a1.dest_port.values,a1['flight_end'].values,cust_dest,cust_abs_end,df4,i)

In [8]:
df4

  Customer_ID Ticket_ID Flight_no
0        A123   9342312       B79
1        A123   9342312       B59
2        A123   9342312       B49
3        A123   9342312       B39
4        A456   6542312       B99
5        A789   7542312       B89
6        A789   7542312       B69